{
    "firstName": "Magdalena",
    "lastName": "Kubien",
    "email": "magdalena.kubien(@)gmail.com",
    "intro": "Analyst with long experience changing the path",
    "experience": [
        {
            "dateStart": "Sep 2018",
            "dateEnd": "present",
            "company": "Swedish Social Insurance Agency (Försäkringskassan)",
            "department": "Dep. for analyses",
            "position": "Analyst",
            "description": "My current position combines knowledge on the Swedish social insurance and on what is relevant to present as statistics externally. We colaborate closely with IT when developing register databases and our new statistics database at www.fk.se/statistik.",
            "tasks": [
                "Converting knowledge on the Swedish social insurance and register-based data into relevant statistics.",
                "Together with a colleague we were responsible for creating programming standard (SAS programs) for statistics at www.fk.se/statistik when migrating all statistics from Excel to a new format, including in-built testing.",
                "Reponsible for automating repetetive or complex tasks in VBA Excel",
                "Close cooperation with IT department to update databases according to needs or coming law changes that can better address the analytical questions, defining requirements on facta tables and testing them."
            ]
        },
        {
            "dateStart": "Oct 2014",
            "dateEnd": "Aug 2018",
            "company": "Naturvetarna",
            "department": "Department for communications and impact",
            "position": "Statistician",
            "description": "Development of a new role in a growing organisation.",
            "tasks": [
                "Constant development of the annual salary survey, making the questionnaire relevant to new member groups and trying to assure the results are being used in the organisation",
                "Responsibility for development of our statistics tools, used internally by ombudsmen and externally by our members; organizing trainings for my colleagues and offering support externally during calmer periods. Data was being processed in SAS and Excel incl. VBA",
                "Key role in some of the recruitment projects; processing monthly data from our CRM to better understand what happens to our members during their membership",
                "Support in most statistics- and data-related projects in the organization: related to either salary statistics, information on our members in the CRM, surveys or common projects with other Saco-unions"
            ]
        },
        {
            "dateStart": "Jan 2014",
            "dateEnd": "Jun 2014",
            "company": "Ankizy Gasy & Arnaud Guesry Foundation",
            "department": "Madagascar",
            "position": "Volunteer ",
            "description": "Running English classes and sports in local schools and orphanages and English classes for women in prison.",
            "tasks": [
                "In Ambohidratrimo we taught English in schools (sometimes in very poor schools in the countryside), organized sports and arts&crafts in schools and an orphanage. We painted a school building, including colorful murals.",
                "In Diego Suarez I lived in an orphanage with 16 kids and organized activities for both the young and the older ones. I run English classes for 8 women in the local prison."
            ]
        },
        {
            "dateStart": "Jun 2010",
            "dateEnd": "Jan 2014",
            "company": "Swedish Social Insurance Agency (Försäkringskassan)",
            "department": "Dep. for analyses and forecasts",
            "position": "Analyst/ statistician",
            "description": "At the Section for Statistical Analysis we were responsible for external presentation of the outcome of Swedish social insurance and sustaining analytical databases.",
            "tasks": [
                "Preparation of data and statistics for internal and external clients (researchers, agencies, journalists)",
                "Development and presentation of new statistics on the Agency's webpage",
                "Close cooperation with the IT department to update databases according to needs or coming law changes; development of analytical databases that can better address the analytical questions",
                "Help with conducting questionnaires: sampling, analyses, contacts with different parts of the organization",
                "Taking part in segmentation performed on the Swedish population 16-64: creating a database (a few hundred variables based on registry and survey data), analysing the segments and presenting results, using the comprehensive database for answering ad hoc analytical queries (e.g. as part of governmental discussion about closing the service offices)",
                "Main tools: SAS EG, SQL, SPSS, Excel (incl. VBA)"
            ]
        },
        {
            "dateStart": "Apr 2006",
            "dateEnd": "May 2010",
            "company": "TNS Poland",
            "department": "Dep. for statistical sampling and analyses",
            "position": "Analyst",
            "description": "My main tasks included preparing survey samples and analysing the data after surveys were conducted.",
            "tasks": [
                "Data processing and analysing for the needs of researchers who were responsible for presenting the results externally",
                "Weight computation, data cleaning",
                "Automation of repetitive tasks with SPSS syntax, VBA Excel",
                "Sampling: processing customers databases, preparing samples for telephone, paper and computer aided interviews",
                "Main tools: SAS EG, SQL, SPSS, Excel (incl. VBA)"
            ]
        }
    ],
    "education": [
        {
            "dateStart": "2023",
            "dateEnd": "2025",
            "school": "Chas Academy",
            "place": "Stockholm",
            "program": "Full stack development .NET",
            "description": [
                "We learn C#, SQL, HTML, CSS, JavaScript, Git.",
                "We work in Visual Studio, Visual Studio Code, Microsoft SQL Server, Azure.",
                "We use Entity Framework, LINQ, RESTful API, React, Blazor and Razor.",
                "We learn about WCAG, UML and Agile methodologies.",
                "We have several group projects, with the biggest one being Chas Challenge where we cowork with other classes, including UX-designers, DevOps and frontend developers."
            ]
        },
        {
            "dateStart": "2002",
            "dateEnd": "2008",
            "school": "Warsaw School of Economics",
            "place": "Poland",
            "program": "Quantitative Methods in Economics and Information Systems",
            "description": [
                "Master's degree",
                "Specialization: Econometrics"
            ]
        }
    ],
    "languages": [
        {
            "language": "Polish",
            "level": "Mother tongue"
        },
        {
            "language": "Swedish",
            "level": "Fluent"
        },
        {
            "language": "English",
            "level": "Fluent"
        },
        {
            "language": "French",
            "level": "Able to communicate"
        }
    ]
}